# Monday Morning Warmup

> Take the word EASY: Its first three letters — E, A and S — are the fifth, first, and nineteenth letters, respectively, in the alphabet. If you add 5, 1, and 19, you get 25, which is the value of the alphabetical position of Y, the last letter of EASY.
>
> Can you think of a common five-letter word that works in the opposite way — in which the value of the alphabetical positions of its last four letters add up to the value of the alphabetical position of its first letter?

In [28]:
with open('/usr/share/dict/words') as f:
    words = f.read().strip().split('\n')

print(f'There are {len(words):,} words.')
print(words[30000:30005])

There are 235,886 words.
['capivi', 'capkin', 'capless', 'caplin', 'capmaker']


Plan:

1. Find the 5 letter words
1. Write a function that calculates the alphabetical position of a letter
1. loop through the 5 letter words
    1. Calculate the alphabetical position of each letter
    1. Check if the sum of the last 4 == the first letter

In [29]:
five_letter_words = [w for w in words if len(w) == 5]

def alphabetical_position(c):
    return 'abcdefghijklmnopqrstuvwxyz'.index(c.lower()) + 1
def alphabetical_value(letters):
    return sum([alphabetical_position(c) for c in letters])

alphabetical_position('a')

1

In [30]:
alphabetical_position('y')

25

In [32]:
alphabetical_value('ab')

3

In [31]:
alphabetical_value('zz')

52

In [33]:
for word in five_letter_words:
    # first_letter, *last_four_letters = word
    first_letter = word[0]
    last_four_letters = word[1:]
    if alphabetical_value(first_letter) == alphabetical_value(last_four_letters):
        print(word)

raffe
Sadie
sifac
table
Uchee
vakia
Vicia
wanga
whack
Xicak
yeara
zebra

With pandas:

In [43]:
import pandas as pd

df = pd.DataFrame({'word': words})
df.head()

    word
0      A
1      a
2     aa
3    aal
4  aalii

In [45]:
df.word.apply(len) == 5

0         False
1         False
2         False
3         False
4          True
          ...
235881    False
235882    False
235883    False
235884    False
235885    False
Name: word, Length: 235886, dtype: bool

In [46]:
# just the 5 letter words
df = df[df.word.apply(len) == 5]
df.head()

     word
4   aalii
9   Aaron
20  abaca
27  aback
35  abaff

In [47]:
df['first_letter'] = df.word.str[0]
df['last_four'] = df.word.str[1:]
df

         word first_letter last_four
4       aalii            a      alii
9       Aaron            A      aron
20      abaca            a      baca
27      aback            a      back
35      abaff            a      baff
...       ...          ...       ...
235714  zudda            z      udda
235749  zygal            z      ygal
235796  zygon            z      ygon
235840  zymic            z      ymic
235841  zymin            z      ymin

[10230 rows x 3 columns]

In [48]:
df['first_letter_val'] = df.first_letter.apply(alphabetical_position)
df['last_4_val'] = df.last_four.apply(alphabetical_value)
df

         word first_letter last_four  first_letter_val  last_4_val
4       aalii            a      alii                 1          31
9       Aaron            A      aron                 1          48
20      abaca            a      baca                 1           7
27      aback            a      back                 1          17
35      abaff            a      baff                 1          15
...       ...          ...       ...               ...         ...
235714  zudda            z      udda                26          30
235749  zygal            z      ygal                26          45
235796  zygon            z      ygon                26          61
235840  zymic            z      ymic                26          50
235841  zymin            z      ymin                26          61

[10230 rows x 5 columns]

In [50]:
df[df.first_letter_val == df.last_4_val].word

162735    raffe
172406    Sadie
181168    sifac
197206    table
210149    Uchee
226709    vakia
228545    Vicia
230352    wanga
231506    whack
234120    Xicak
234512    yeara
235088    zebra
Name: word, dtype: object